babymonitor/babymonitor/logs/ab_status.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        Werkzeug/3.1.3
Server Hostname:        127.0.0.1
Server Port:            5000

Document Path:          /api/status
Document Length:        37 bytes

Concurrency Level:      5
Time taken for tests:   0.744 seconds
Complete requests:      200
Failed requests:        0
Total transferred:      40400 bytes
HTML transferred:       7400 bytes
Requests per second:    268.72 [#/sec] (mean)
Time per request:       18.607 [ms] (mean)
Time per request:       3.721 [ms] (mean, across all concurrent requests)
Transfer rate:          53.01 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:    12   18   3.5     17      32
Waiting:        2    5   2.8      5      15
Total:         13   18   3.5     17      32

Percentage of the requests served within a certain time (ms)
  50%     17
  66%     19
  75%     21
  80%     21
  90%     23
  95%     25
  98%     29
  99%     30
 100%     32 (longest request)